---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
CurveElementFilter..::..PassesFilter Method
CurveElementFilter Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | PassesFilter(Element) | Applies the filter to a given element.  (Inherited from ElementFilter.) |
|  | PassesFilter(Document, ElementId) | Applies the filter to a given element.  (Inherited from ElementFilter.) |

# See Also

CurveElementFilter Class

CurveElementFilter Members

Autodesk.Revit.DB Namespace